/*Задача 10: Напишите программу, которая принимает на вход 
трёхзначное число и на выходе показывает вторую цифру этого числа.*/
/*
int SecondNumber( int number){
    int second = (number / 10) % 10; 
    
return second;
}
    
Console.WriteLine("Введите  любое трехзначное число от 100 до 999 ");
int YourNumber = Convert.ToInt32(Console.ReadLine());
int resultat = SecondNumber(YourNumber);
Console.WriteLine($"Вы ввели число {YourNumber} , вторая цифра вашего числа {resultat} ");
*/

/*
